canvas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-27 Fri 09:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CodeLab I</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matthew Thompson" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">CodeLab I</h1>
<br>

<div id="outline-container-org982e01d" class="outline-2">
<h2 id="org982e01d">Week 23 workshop: Canvas Painter Challenge</h2>
<div class="outline-text-2" id="text-org982e01d">
<p>
This week's challenge is to create a fully-functional painting tool in HTML canvas using JavaScript.
</p>

<p>
Have a look at this <a href="http://web.codeuntangled.com/canvas/painter/painter.html">example</a> to see the kind of thing you can make. This example implements the very basics of a painting tool, including:
</p>

<ul class="org-ul">
<li>ability to change the brush shape</li>
<li>sliders to change the colour and opacity of the brush</li>
<li>sliders to change the width and height of the brush</li>
</ul>

<p>
To learn how to use sliders, have a look at <a href="https://www.w3schools.com/howto/howto_js_rangeslider.asp">this tutorial</a>.
</p>

<p>
This simple demo is limited to drawing just two brushes: ellipses (using the <code>ellipse()</code> function instead of <code>arc()</code>) and rectangles. See if you can extend it to draw some more creative brush styles.
</p>

<p>
Also, the demo just draws a shape every time you click on the canvas. See if you can implement a feature to click and drag to paint properly. You can also experiment with adding line-drawing functionality.
</p>

<p>
Good luck, and have fun!
</p>
</div>
</div>
</div>
</body>
</html>